Revit 2027 API
Document.IsWorkshared Property
 Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document. Also, see IsDetached
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWorkshared { get; }
Public ReadOnly Property IsWorkshared As Boolean
	Get
public:
property bool IsWorkshared {
	bool get ();
}
member IsWorkshared : bool with get
Property Value
Boolean
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace